src/cf/Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Валюты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Валюта = Элементы.Список.ТекущаяСтрока; /// Ссылка на валюту
	
	Курс = ПолучитьКурсВалюты(Валюта);
	
	Если Курс = Неопределено Тогда
		Элементы.КурсВалюты.Заголовок =	"Данные о курсе валюты " + Валюта + " отсутствуют!";
	Иначе	
		Элементы.КурсВалюты.Заголовок =
		"Курс валюты " + Валюта + " на " + Формат(НужнаяДата, "ДЛФ=DD") +
		" составляет " + Курс + " руб.";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты(Вал)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Период КАК Период,
	               |	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	               |	КурсыВалютСрезПоследних.Курс КАК Курс
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", НужнаяДата);
	Запрос.УстановитьПараметр("Валюта", Вал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Курс = ?(РезультатЗапроса.Пустой(), Неопределено, РезультатЗапроса.Выгрузить()[0].Курс);
	
	Возврат Курс;

КонецФункции // ПолучитьКурсВалюты()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НужнаяДата = ТекущаяДата();
	
КонецПроцедуры


&НаКлиенте
Процедура НужнаяДатаПриИзменении(Элемент)
	
	СписокПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры
